{"config": {"name": "sequential_2", "layers": [{"config": {"kernel_size": [4, 4], "name": "conv2d_3", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 480, 752, 1], "trainable": true, "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "padding": "valid", "activation": "relu", "dtype": "float32", "kernel_regularizer": null, "kernel_constraint": null, "filters": 16, "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "name": "max_pooling2d_5", "pool_size": [2, 2], "trainable": true, "dtype": "float32", "strides": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "name": "max_pooling2d_6", "pool_size": [2, 2], "trainable": true, "dtype": "float32", "strides": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"kernel_size": [4, 4], "name": "conv2d_4", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "trainable": true, "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "padding": "valid", "activation": "relu", "dtype": "float32", "kernel_constraint": null, "filters": 4, "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "name": "max_pooling2d_7", "pool_size": [2, 2], "trainable": true, "dtype": "float32", "strides": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "name": "max_pooling2d_8", "pool_size": [2, 2], "trainable": true, "dtype": "float32", "strides": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "name": "flatten_2", "trainable": true, "dtype": "float32"}, "class_name": "Flatten"}, {"config": {"name": "dense_4", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "trainable": true, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "units": 10, "bias_regularizer": null, "activation": "relu", "dtype": "float32", "kernel_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dense_5", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "trainable": true, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "units": 10, "bias_regularizer": null, "activation": "relu", "dtype": "float32", "kernel_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dense_6", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "trainable": true, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "units": 1, "bias_regularizer": null, "activation": "sigmoid", "dtype": "float32", "kernel_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}]}, "keras_version": "2.3.1", "backend": "tensorflow", "class_name": "Sequential"}