{"config": {"layers": [{"class_name": "Conv2D", "config": {"use_bias": true, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "batch_input_shape": [null, 480, 752, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_regularizer": null, "data_format": "channels_last", "name": "conv2d_1", "dtype": "float32", "padding": "valid", "activation": "relu", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16, "strides": [1, 1], "bias_constraint": null, "kernel_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [20, 20], "trainable": true, "name": "max_pooling2d_1", "dtype": "float32", "padding": "valid", "data_format": "channels_last", "strides": [20, 20]}}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "trainable": true, "name": "flatten_1", "dtype": "float32"}}, {"class_name": "Dense", "config": {"use_bias": true, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "units": 8, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_regularizer": null, "bias_constraint": null, "name": "dense_1", "dtype": "float32", "activation": "relu", "activity_regularizer": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"use_bias": true, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_regularizer": null, "bias_constraint": null, "name": "dense_2", "dtype": "float32", "activation": "sigmoid", "activity_regularizer": null, "kernel_regularizer": null}}], "name": "sequential_1"}, "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.3.1"}